app/controllers/items_controller.rb

SELECT  "items".* FROM "items" WHERE "items"."list" = ? ORDER BY popularity desc LIMIT ?  [["list", "f"], ["LIMIT", 1]]
SELECT "items".* FROM "items"
---
  def index
    @shopping = Item.all.where(list: "f").order("popularity desc")
    @top_list = Item.all

SELECT "items".* FROM "items" WHERE "items"."category" = ?  [["category", "m"]]
---
  def men
    @shopping = Item.all.where(category: "m")

SELECT "items".* FROM "items" WHERE "items"."category" = ?  [["category", "f"]]
---
  def female
    @shopping = Item.all.where(category: "f")

SELECT "items".* FROM "items" WHERE "items"."category" = ?  [["category", "k"]]
---
  def kids
    @shopping = Item.all.where(category: "k")

SELECT "items".* FROM "items" WHERE "items"."list" = ?  [["list", "t"]]
---
  def save
    @shopping = Item.all.where(list: "t")

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "items" SET "list" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["list", "t"], ["updated_at", "2021-05-18 03:49:51.100673"], ["id", 4]]
UPDATE "items" SET "popularity" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["popularity", 1], ["updated_at", "2021-05-08 11:54:31.129498"], ["id", 1]]
UPDATE "items" SET "popularity" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["popularity", 1], ["updated_at", "2021-05-08 11:55:24.727360"], ["id", 4]]
---
  def add
    @shopping = Item.find(params[:id])
    @shopping.update(list: "t")

    @curr_pop = @shopping.popularity
    @curr_pop += 1
    @shopping.update(popularity: @curr_pop)
    @shopping.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "items" SET "list" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["list", "f"], ["updated_at", "2021-05-08 11:54:28.785295"], ["id", 1]]
UPDATE "items" SET "list" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["list", "f"], ["updated_at", "2021-05-08 11:55:21.909033"], ["id", 1]]
---
  def remove
    @shopping = Item.find(params[:id])
    @shopping.update(list: "f")
    @shopping.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def item_details
    @current_item = Item.find(params[:id])

INSERT INTO "bags" ("title", "body", "category", "price", "image", "size", "color", "quantity", "user", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def add_bag

    if current_user
      title = params[:title]
      body = params[:body]
      category = params[:category]
      price = params[:price].to_i
      image = params[:image]
      size = params[:size]
      color = params[:color]
      quantity = params[:quantity].to_i
      email = current_user.email

      new_bag = Bag.new(title: title, body: body, category: category, price: price, image: image, size: size, color: color, quantity: quantity, user: email)
      new_bag.save

SELECT "bags".* FROM "bags" WHERE "bags"."user" = ?  [["user", "utariq68@hotmail.com"]]
---
  def bag
    if current_user
      current_user_email = current_user.email
      @bag_items = Bag.all.where(user: current_user_email)

      @total = 0
      @bag_items.each do |item|

SELECT  "bags".* FROM "bags" WHERE "bags"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
DELETE FROM "bags" WHERE "bags"."id" = ?  [["id", 8]]
---
  def remove_bag
    @item = Bag.find(params[:id])
    @item.destroy

SELECT "bags".* FROM "bags" WHERE "bags"."user" = ?  [["user", "utariq68@hotmail.com"]]
---
  def checkout
    if current_user
      current_user_email = current_user.email
      @bag_items = Bag.all.where(user: current_user_email)

      @bag_items.each do |item|

SELECT "subscribers".* FROM "subscribers" WHERE "subscribers"."email" = ?  [["email", "utariq68@hotmail.com"]]
SELECT  1 AS one FROM "subscribers" WHERE "subscribers"."email" = ? LIMIT ?  [["email", "utariq68@hotmail.com"], ["LIMIT", 1]]
INSERT INTO "subscribers" ("email", "created_at", "updated_at") VALUES (?, ?, ?)  [["email", "utariq68@hotmail.com"], ["created_at", "2021-05-18 10:38:08.974373"], ["updated_at", "2021-05-18 10:38:08.974373"]]
---
  def edit_subscription
    user_email = current_user.email
    @message = nil

    check = Subscriber.all.where(email: user_email)

    if check.exists?
      check.each do |email|
        email.destroy
      end
      @message = 'Removed from subscriber list!'
    else
      new_sub = Subscriber.new(email: user_email)
      new_sub.save