app/controllers/items_controller.rb

  def index
    @shopping = Item.all

    @top_list = Item.all.where(list: "f").order("popularity desc")
    @topbanner_item = @top_list.first()
---
SELECT  "items".* FROM "items" LIMIT ?  [["LIMIT", 11]]