app/controllers/news_letter_controller.rb

INSERT INTO "subscribers" ("email", "created_at", "updated_at") VALUES (?, ?, ?)  [["email", "test@test.com"], ["created_at", "2021-05-18 10:21:50.688781"], ["updated_at", "2021-05-18 10:21:50.688781"]]
---
  def newsletter
    @email = params[:email]

    if @email != nil
      check = Subscriber.all.where(email: @email)

      if not check.exists?
        new_sub = Subscriber.new(email: @email)
        new_sub.save