app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at", "name") VALUES (?, ?, ?, ?, ?)